app/Controllers/Notification/NotificationController.php

    public function fetchUnread($userGroupId)
    {
        $notifications = $this->notificationModel
            ->where('user_group_id', $userGroupId)
            ->orderBy('id','DESC')
---
SELECT *
FROM `notifications`
WHERE `user_group_id` = '1'
ORDER BY `id` DESC