app/Controllers/dashboard/Group/GroupController.php

SELECT *
FROM `role`
---
    public function add(){
        $groupmodel = new GroupModel();
        $rolemodel = new RoleModel();
        $pmmodel = new PermissionModel();
        $groupedRoles = [];
        $roles = $rolemodel->findAll();
        foreach ($roles as $role) {
            $groupedRoles[$role['type']][] = $role; // Nhóm quyền theo type
        }
        // dd($groupedRoles);
        $data =[
            'roles' => $rolemodel->findAll(),
            'permissions' => $pmmodel->findAll(),
            'groupedRoles' => $groupedRoles
        ];

INSERT INTO `group` (`groupName`, `description`) VALUES ('quản lý kho', 'Quản lý nguyên liệu')
SELECT `group_id`
FROM `group`
WHERE `groupName` = 'quản lý kho'
 LIMIT 1
---
    public function AddGroupInfo($requestData){
        $validate = $this->ValidateAddGroup($requestData);
        if($validate->getErrors()){
            return [
                'status' => Result::STATUS_CODE_ERR,
                'messageCode' => Result::MESSAGE_CODE_ERR,
                'message' => $validate->getErrors()
            ];
        }

        $datasave = $requestData->getPost();
        try {
            $role = $datasave['role'];
            unset($datasave['role']);
            // dd($role);
            $this->groupmodel->save($datasave);
            $id = $this->groupmodel->select('group_id')->where('groupName',$datasave['groupName'])->first();