app/Controllers/account/AccountController.php

    public function login()
    {
        $session = session();
        $usermodel = new UserModel();
        $username = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        $data = $usermodel->where('email', $username)->first();
---
SELECT *
FROM `user`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1