app/Controllers/main/BookController.php

    public function index()
    {
        $data = [
            'floors' => $this->tables->select('DISTINCT(floor)')->findAll(),
        ];
---
SELECT DISTINCT(floor)
FROM `tables`

    public function getbyfloor(){
        $floor = $this->request->getGetPost('floor');

        if (empty($floor)) {
            echo json_encode(['status' => 'error', 'message' => 'Type ID is required']);
            return;
        }
        $tables = $this->tables->getByfloor($floor);
        $row = $this->tables->selectMax('row')->where('floor',$floor)->first();
        $col = $this->tables->selectMax('col')->where('floor',$floor)->first();
---
SELECT MAX(`row`) AS `row`
FROM `tables`
WHERE `floor` = '1'
 LIMIT 1
SELECT MAX(`col`) AS `col`
FROM `tables`
WHERE `floor` = '1'
 LIMIT 1