app/Controllers/main/BookController.php

    public function create(){
        $session = session();
        $data = $this->request->getPost();

        try {
            foreach($data['tables'] as $table_num){
                $table_id = $this->tables->select('id')->where('table_num',$table_num)->first();
                $datasave = [
                    'table_id' => $table_id['id'],
                    'customer_name' => $session->get('name'),
                    'phone_number' => $session->get('phone_num'),
                    'request' => $data['request'],
                    'time' => $data['time']
                ];
                // dd($datasave);

                if (!$this->bookings->save($datasave)) {
---
SELECT `id`
FROM `tables`
WHERE `table_num` = '103'
 LIMIT 1
INSERT INTO `bookings` (`table_id`, `customer_name`, `phone_number`, `request`, `time`) VALUES ('12', 'admin', '123456789', 'menu 1, có', '2025-02-14T04:55')