app/Controllers/dashboard/Table/BookingController.php

SELECT `id`, `table_num`
FROM `tables`
---
    public function index()
    {
        $booking = new BookingModel();
        $search = $this->request->getGet('search') ?? '';
        $perPage = $this->request->getGet('per_page') ?? 10;
        $currentPage = $this->request->getGet('page') ?? 1;
        $table = $this->tables->select('id, table_num')->findAll();