app/Controllers/dashboard/User/UserDataController.php

    public function index()
    {
        $groupmodel = new GroupModel();
        $search = $this->request->getGet('search') ?? '';
        $perPage = $this->request->getGet('per_page') ?? 10;
        $currentPage = $this->request->getGet('page') ?? 1;
        $offset = ($currentPage - 1) * $perPage;
        $groupfilter = $this->request->getGet('groupfilter') ?? '';
        $data =[
            'groups' => $groupmodel->findAll(),
            'users' => $this->users->searchUsers($search, $perPage, $offset,$groupfilter),
            'search' => $search,
            'perPage' => $perPage,
            'currentPage' => $currentPage,
            'total' => $this->users->getCount($search),
            'groupfilter' => $groupfilter,
        ];
---
SELECT *
FROM `group`

    public function DeleteUser($id){
        try {
            $this->users->delete(['id'=>$id]);
---
DELETE FROM `user`
WHERE `id` IN ('30')