app/Models/BookingModel.php

    public function search($search = '', $perPage = 10, $offset = 0,$group ='')
    {
        if ($search) {
            $this->like('customer_name', $search)
                 ->orLike('phone_number', $search)
                 ->orLike('request',$search);
        }
        return $this->findAll($perPage, $offset);
---
SELECT *
FROM `bookings`
 LIMIT 10

    public function getCount($search = '')
    {
        if ($search) {
            $this->like('customer_name', $search)
                 ->orLike('phone_number', $search)
                 ->orLike('request',$search);
        }

        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `bookings`