app/Models/GroupModel.php

    public function search($search = '', $perPage = 10, $offset = 0,$group ='')
    {
        if ($search) {
            $this->like('groupName', $search)
                 ->orLike('description', $search);
        }
        return $this->findAll($perPage, $offset);
---
SELECT *
FROM `group`
 LIMIT 10

    public function getCount($search = '')
    {
        if ($search) {
            $this->like('groupName', $search)
                 ->orLike('description', $search);
        }

        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `group`