app/Models/TableModel.php

SELECT `table_num`, `status`, `row`, `col`
FROM `tables`
WHERE `floor` = '1'
---
    public function getByfloor($floor) {
        return $this->select('table_num,status,row,col')->where('floor', $floor)->findAll();