app/Models/UserModel.php

SELECT *
FROM `user`
ORDER BY `id` DESC
 LIMIT 10
---
    public function searchUsers($search = '', $perPage = 10, $offset = 0,$group ='')
    {
        if ($search) {
            $this->like('name', $search)
                 ->orLike('email', $search);
        }
        if($group){
            $this->like('group_id',$group);
        }
        return $this->orderBy('id', 'DESC')
                    ->findAll($perPage, $offset);

SELECT COUNT(*) AS `numrows`
FROM `user`
---
    public function getCount($search = '')
    {
        if ($search) {
            $this->like('name', $search)
                 ->orLike('email', $search);
        }

        return $this->countAllResults();